#include<stdio.h>

int main_m_array(void)
{
	//다차원 배열 Mutidimesional Array
	int i; // □


	int arr[5]; //1차원 배열
	// □□□□□
	//[0][1][2][3][4]

	int arr2[2][5]; //2차원 배열
	// □□□□□
	// □□□□□
	//[0,0][0,1][0,2][0,3][0,4]   -> ex) arr2[0][0]
	//[1,0][1,1][1,2][1,3][1,4]   -> ex) arr2[1][4]

	int arr3[4][2];
	// □□
	// □□
	// □□
	// □□


	int arr4[3][3][3];
	// □□□
	// □□□
	// □□□

	// □□□
	// □□□
	// □□□

	// □□□
	// □□□
	// □□□

	//선언
	int arr5[2][5] = { 
		{1,2,3,4,5},
		{1,2,3,4,5}
	};
	int arr6[3][3][3] = {
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		},{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		} ,{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		}
	};
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 3; k++)
			{
			printf("3차원배열<%d, %d, %d>의 값 : %d\n", i, j, k, arr6[i][j][k]);
			}
			printf("\n");
		}
		printf("\n\n");
	}

	



	return 0;
}